# Ex3 - Getting and Knowing your Dataexercises

### Step 1. Import the necessary libraries

In [331]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [251]:
dset = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep='|')
dset.index

RangeIndex(start=0, stop=943, step=1)

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [252]:
# Asigno el data set anterior a user. Asigno su índice igual a la columna user_id y luego elimino la columna
user = dset
user.index = user.user_id
user = user.drop('user_id',1)

### Step 4. See the first 25 entries

In [253]:
user.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [256]:
user.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [259]:
# user.shape      #devuelve una tupla con las filas y columnas
user.shape[0]      #la posicion 0 de la tupla son las filas

943

In [19]:
user.shape[0]

943

943

In [261]:
user.shape[1]   #la posicion 1 de la tupla son las columnas

4

### Step 7. What is the number of columns in the dataset?

In [20]:
user.shape[1]

5

In [119]:
user.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 8. Print the name of all the columns.

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [120]:
user.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 9. How is the dataset indexed?

In [46]:
# "the index" (aka "the labels")

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [157]:
user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB

In [264]:
user.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [34]:
type(user.columns)

pandas.core.indexes.base.Index

### Step 10. What is the data type of each column?

In [123]:
user['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [269]:
a = user.groupby('occupation').count()
print (a)
print(len(a),'\n')
print("------------------")
b = user['occupation'].unique()
print (b)
print("------------------")
print(len(b))

age  gender  zip_code
occupation
administrator   79      79        79
artist          28      28        28
doctor           7       7         7
educator        95      95        95
engineer        67      67        67
entertainment   18      18        18
executive       32      32        32
healthcare      16      16        16
homemaker        7       7         7
lawyer          12      12        12
librarian       51      51        51
marketing       26      26        26
none             9       9         9
other          105     105       105
programmer      66      66        66
retired         14      14        14
salesman        12      12        12
scientist       31      31        31
student        196     196       196
technician      27      27        27
writer          45      45        45
21

------------------
['technician' 'other' 'writer' 'executive' 'administrator' 'student'
 'lawyer' 'educator' 'scientist' 'entertainment' 'programmer' 'librarian'
 'homemaker' 'artist' 'engineer' 'marketing' 'none' 'healthcare' 'retired'
 'salesman' 'doctor']
------------------
21

user_id
1         technician
2              other
3             writer
4         technician
5              other
6          executive
7      administrator
8      administrator
9            student
10            lawyer
11             other
12             other
13          educator
14         scientist
15          educator
16     entertainment
17        programmer
18             other
19         librarian
20         homemaker
21            writer
22            writer
23            artist
24            artist
25          engineer
26          engineer
27         librarian
28            writer
29        programmer
30           student
           ...
914            other
915    entertainment
916         engineer
917          student
918        scientist
919            other
920           artist
921          student
922    administrator
923          student
924            other
925         salesman
926    entertainment
927       programmer
928          student
929        scientist
930        scientist
931         educator
932         educator
933          student
934         engineer
935           doctor
936            other
937         educator
938       technician
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [212]:
#Agrupa por occupation en orden descendente
a = user.groupby('occupation').count().sort_values(['age'],ascending=False) 

#a.head(1)             #Muestra la primera fila del resultado de la agrupacion
#a.index.to_list()[0]  #Convierte el índice a una lista y muestra la primera posición de la lista
a.index.values[0]      #Muestra el valor de la primera posicion del índice (pues  al hacer groupby  es la columna occupation)

#user['occupation'].unique()  Muestra un array con los diferentes valores de occupation

'student'

In [311]:
# Solucion 2
user.describe(include='all')['occupation']['top']

'student'

In [312]:
# Solucion 3
user.occupation.describe()['top']

'student'

In [69]:
 #user.groupby('occupation'). user_id.count().max()
a = user.groupby('occupation').count().sort_values(['user_id'],ascending=False)
a.head(1)

            user_id  age  gender  zip_code
occupation
student         196  196     196       196

21

In [164]:
user

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [129]:

user.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 13. What is the most frequent occupation?

### Step 14. Summarize the DataFrame.

In [280]:
user.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

'student'

In [70]:
user.describe()

          user_id         age
count  942.000000  942.000000
mean   472.500000   34.062633
std    272.076276   12.194810
min      2.000000    7.000000
25%    237.250000   25.000000
50%    472.500000   31.000000
75%    707.750000   43.000000
max    943.000000   73.000000

In [304]:
s = user.occupation.describe()
print(s)
type(s)
#s.index        #Indice del array que contiene el describe (count,unique, top y freq)
#s.values[2]    #la posicion 2 del array contiene top, es decir la ocupacion más repetida en los datos
#s['top']       # la columna top del array contiene la ocupacion más repetida en los datos

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

pandas.core.series.Series

In [310]:
user.describe(include='all')['occupation']['top']

'student'

### Step 15. Summarize all the columns

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [313]:
user.age.mean()

34.05196182396607

### Step 16. Summarize only the occupation column

### Step 17. What is the mean age of users?

In [329]:
a = user.groupby('age').count()
es_uno = a.loc[:, 'gender'] == 1
df_uno = a.loc[es_uno]
= user.groupby('age').count()
es_uno = a.loc[:, 'gender'] == 1
df_uno = a.loc[es_uno]
df_uno['gender']

age
7     1
10    1
11    1
66    1
73    1
Name: gender, dtype: int64

In [146]:
a = user.groupby('age').count()#.sort_values(['gender'],ascending=True)
a

     gender  occupation  zip_code
age
7         1           1         1
10        1           1         1
11        1           1         1
13        5           5         5
14        3           3         3
..      ...         ...       ...
66        1           1         1
68        2           2         2
69        2           2         2
70        3           3         3
73        1           1         1

[61 rows x 3 columns]

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

34

### Step 18. What is the age with least occurrence?

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64